## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # azurerm_subnet.subnet must be replaced
-/+ resource "azurerm_subnet" "subnet" {
      ~ enforce_private_link_endpoint_network_policies = false -> (known after apply)
      ~ enforce_private_link_service_network_policies  = false -> (known after apply)
      ~ id                                             = "/subscriptions/8645e34f-3344-494c-acd6-d6785e830b27/resourceGroups/bhun0002-bhup0006-a12-rg/providers/Microsoft.Network/virtualNetworks/my-vnet/subnets/my-subnet" -> (known after apply)
      ~ name                                           = "my-subnet" -> "bhup0006-subnet" # forces replacement
      ~ private_endpoint_network_policies              = "Enabled" -> (known after apply)
      ~ private_endpoint_network_policies_enabled      = true -> (known after apply)
      ~ private_link_service_network_policies_enabled  = true -> (known after apply)
      - service_endpoint_policy_ids                    = [] -> null
      - service_endpoints                              = [] -> null
      ~ virtual_network_name                           = "my-vnet" -> "bhup0006-bhun0002" # forces replacement
        # (3 unchanged attributes hidden)
    }

  # azurerm_virtual_network.vnet must be replaced
-/+ resource "azurerm_virtual_network" "vnet" {
      ~ dns_servers             = [] -> (known after apply)
      - flow_timeout_in_minutes = 0 -> null
      ~ guid                    = "0d9b7d18-fdde-4257-8837-31f326da1ca5" -> (known after apply)
      ~ id                      = "/subscriptions/8645e34f-3344-494c-acd6-d6785e830b27/resourceGroups/bhun0002-bhup0006-a12-rg/providers/Microsoft.Network/virtualNetworks/my-vnet" -> (known after apply)
      ~ name                    = "my-vnet" -> "bhup0006-bhun0002" # forces replacement
      ~ subnet                  = [
          - {
              - address_prefix = "10.0.1.0/24"
              - id             = "/subscriptions/8645e34f-3344-494c-acd6-d6785e830b27/resourceGroups/bhun0002-bhup0006-a12-rg/providers/Microsoft.Network/virtualNetworks/my-vnet/subnets/my-subnet"
              - name           = "my-subnet"
                # (1 unchanged attribute hidden)
            },
        ] -> (known after apply)
      - tags                    = {} -> null
        # (5 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

Changes to Outputs:
  ~ subnet_name          = "my-subnet" -> "bhup0006-subnet"
  ~ virtual_network_name = "my-vnet" -> "bhup0006-bhun0002"
```
</details>